# RbsElecPanelFeedThruLugsParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecPanelFeedThruLugsParam Property
ParameterTypeId Class See Also
---
"Feed Through Lugs"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecPanelFeedThruLugsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecPanelFeedThruLugsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecPanelFeedThruLugsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace